<a href="https://colab.research.google.com/github/kay-kay-t/CodingDojo/blob/main/02_Pandas_Exercises_on_the_Titanic_Dataset.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
import pandas as pd

In [ ]:
# Loading data
titanic_df = pd.read_csv('/content/titanic.csv')

In [ ]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

1. Display the head of the dataframe.

In [ ]:
titanic_df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

2. What is the percentage of people who survived? (hint: find the mean of the survival column).

In [ ]:
# Finding mean of people survived
survived = titanic_df['Survived'].mean()
round(survived * 100, 1)

38.4

3. How many of each sex survived?

In [ ]:
# Filtering data by male and female survivers
survived = titanic_df['Survived'] == 1
male = titanic_df['Sex'] == 'male'
female = titanic_df['Sex'] == 'female'
male_survived = titanic_df.loc[survived & male]
female_survived = titanic_df.loc[survived & female]

In [ ]:
len(male_survived)

109

In [ ]:
len(female_survived)

233

4. Considering only the group of passengers who paid less than $10, what percentage of this group survived?

In [ ]:
# Filtering based on price paid and survived
survived = titanic_df['Survived'] == 1
price = titanic_df['Fare'] < 10
under_10_survived = titanic_df.loc[survived & price]
parcentage = len(under_10_survived) / len(titanic_df) * 100
round(parcentage, 1)

7.5

5. Overall, what is the average age of those who didn't survive?

In [ ]:
# Filtering by age and survived
not_survived = titanic_df['Survived'] == 0
dead_age = titanic_df.loc[not_survived]
dead_average = dead_age['Age'].mean()
round(dead_average)

31

6. Overall, what is the average age of those who did survive?

In [ ]:
# Filtering by age and survived
survived = titanic_df['Survived'] == 1
survived_age = titanic_df.loc[survived]
survived_average = survived_age['Age'].mean()
round(survived_average)

28

7. What is the average age of those who did and didn't survive grouped by Sex?

In [ ]:
round(titanic_df.groupby(['Sex', 'Survived'])[['Age']].mean())

                  Age
Sex    Survived
female 0         25.0
       1         29.0
male   0         32.0
       1         27.0